1. Написать все наше пройденные ограничение, и написать своими словами кто за что отвечает, представьте вы это объясните своему другу

NOT NULL
не позволяет записывать пустое значение в столбец. Столбец обязательно получит значение.

PRIMARY KEY

Гарантирует, что каждое значение будет уникальным.

2. Напишите своими словами что такое дефолтное значение и приведите пример

Значение вставляется по умолчанию, если оно не вводится пользователем. Например, если не заполнен возраст, то будет вставляться значение возраста по умолчанию.

3. Напишите своими словами что такое проверка в MYSQL, и как она пишется в Инициализация таблицы
Ограничение, усанавливающее условие, которым должны соответствовать вводимые данные.
Вызывается командой CHECK
